{"class_name": "Model", "config": {"name": "model_188", "layers": [{"name": "gen_input_layer_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "name": "gen_input_layer_0"}, "inbound_nodes": []}, {"name": "gen_dense_layer_1", "class_name": "Dense", "config": {"name": "gen_dense_layer_1", "trainable": true, "units": 1024, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gen_input_layer_0", 0, 0, {}]]]}, {"name": "gen_dense_layer_2", "class_name": "Dense", "config": {"name": "gen_dense_layer_2", "trainable": true, "units": 6272, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gen_dense_layer_1", 0, 0, {}]]]}, {"name": "gen_batch_layer_3", "class_name": "BatchNormalization", "config": {"name": "gen_batch_layer_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["gen_dense_layer_2", 0, 0, {}]]]}, {"name": "gen_reshape_layer_4", "class_name": "Reshape", "config": {"name": "gen_reshape_layer_4", "trainable": true, "target_shape": [7, 7, 128]}, "inbound_nodes": [[["gen_batch_layer_3", 0, 0, {}]]]}, {"name": "gen_upsample2d_layer_5", "class_name": "UpSampling2D", "config": {"name": "gen_upsample2d_layer_5", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["gen_reshape_layer_4", 0, 0, {}]]]}, {"name": "gen_conv2d_layer_6", "class_name": "Conv2D", "config": {"name": "gen_conv2d_layer_6", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gen_upsample2d_layer_5", 0, 0, {}]]]}, {"name": "gen_upsample2d_layer_7", "class_name": "UpSampling2D", "config": {"name": "gen_upsample2d_layer_7", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["gen_conv2d_layer_6", 0, 0, {}]]]}, {"name": "gen_output_layer_8", "class_name": "Conv2D", "config": {"name": "gen_output_layer_8", "trainable": true, "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gen_upsample2d_layer_7", 0, 0, {}]]]}, {"name": "dis_conv2d_layer_1", "class_name": "Conv2D", "config": {"name": "dis_conv2d_layer_1", "trainable": false, "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["gen_output_layer_8", 0, 0, {}]]]}, {"name": "dis_maxpool2d_layer_2", "class_name": "MaxPooling2D", "config": {"name": "dis_maxpool2d_layer_2", "trainable": false, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["dis_conv2d_layer_1", 0, 0, {}]]]}, {"name": "dis_conv2d_layer_3", "class_name": "Conv2D", "config": {"name": "dis_conv2d_layer_3", "trainable": false, "filters": 128, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dis_maxpool2d_layer_2", 0, 0, {}]]]}, {"name": "dis_globalavgpool2d_layer_4", "class_name": "GlobalAveragePooling2D", "config": {"name": "dis_globalavgpool2d_layer_4", "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["dis_conv2d_layer_3", 0, 0, {}]]]}, {"name": "dis_output_layer_5", "class_name": "Dense", "config": {"name": "dis_output_layer_5", "trainable": false, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dis_globalavgpool2d_layer_4", 0, 0, {}]]]}], "input_layers": [["gen_input_layer_0", 0, 0]], "output_layers": [["dis_output_layer_5", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}